Autodesk.Revit.DB.Visual.SchemaCommon.Category
The property labeled "Category" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.Keyword
The property labeled "Keyword" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyString".
Use ":" to add several keywords.
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.UIName
The property labeled "UIName" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.Description
The property labeled "Description" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.Thumbnail
The property labeled "Thumbnail" from the "PrismTransparent" schema.
Remarks:
This property is a "AssetPropertyList" of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.BaseSchema
The property labeled "BaseSchema" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyString".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.VersionGUID
The property labeled "VersionGUID" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyString" and will contain a uuid.
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon.Hidden
The property labeled "Hidden" from the "PrismTransparent" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.SchemaCommon
Represents the properties of materials.
Since:
2018.1